<?php

/*
|--------------------------------------------------------------------------
| Web Routes
|--------------------------------------------------------------------------
|
| Here is where you can register web routes for your application. These
| routes are loaded by the RouteServiceProvider within a group which
| contains the "web" middleware group. Now create something great!
|
*/

Route::get("/room/{id}", function ($id){
    $rooms=[
        "1"=>[
            "title"=> "Игра в рулетку",
            "description"=> "Инра в рулетку.Выберите число",
            "action"=> [
                "22"=>"2",
                "99"=>"3",
                "88"=>"3",

            ]
        ],
        "2"=>[
            "title"=> "Игра в рулетку.Раунд2",
            "description"=> "Инра в рулетку.Раунд2.Выберите число",
            "action"=> [
                "11"=>"3",
                "12"=>"4",
                "34"=>"3",

            ]
        ],
        "3"=>[
            "title"=> "Вы проиграли",
            "description"=> "Вы проиграли все ваши деньгию идите домой.",

        ],"4"=>[
            "title"=> "Игра в рулетку.Раунд3",
            "description"=> "Инра в рулетку.Раунд3.Выберите число",
            "action"=> [
                "13"=>"3",
                "17"=>"3",
                "07"=>"5",

            ]
        ],
        "5"=>[
            "title"=> "Игра в рулетку.Раунд4",
            "description"=> "Инра в рулетку.Раунд4.Выберите число",
            "action"=> [
                "123"=>"3",
                "0"=>"3",
                "090"=>"6",

            ]
        ],
        "6"=>[
            "title"=> "Игра в рулетку.Раунд5",
            "description"=> "Инра в рулетку.Раунд5.Выберите число",
            "action"=> [
                "2"=>"3",
                "1"=>"3",
                "3"=>"7",

            ]
        ],
        "7"=>[
            "title"=> "Игра в рулетку.Раунд6",
            "description"=> "Инра в рулетку.Раунд6.Выберите число",
            "action"=> [
                "32"=>"8",
                "322"=>"3",
                "223"=>"3",

            ]
        ],
        "8"=>[
            "title"=> "Игра в рулетку.Раунд7",
            "description"=> "Инра в рулетку.Раунд7.Выберите число",
            "action"=> [
                "123"=>"9",
                "22"=>"3",
                "221"=>"3",

            ]
        ],
        "9"=>[
            "title"=> "Игра в рулетку.Раунд8",
            "description"=> "Инра в рулетку.Раунд8.Выберите число",
            "action"=> [
                "1"=>"3",
                "42"=>"10",
                "2"=>"3",

            ]
        ],
        "10"=>[
            "title"=> "Игра в рулетку.Раунд9",
            "description"=> "Инра в рулетку.Раунд9.Выберите число",
            "action"=> [
                "3"=>"3",
                "44"=>"11",
                "77"=>"3",

            ]
        ],
        "11"=>[
            "title"=> "Вы выйграли",
            "description"=> "Вы выйграли, но громилы у входа в казино отобрали ваши деньги...Вы напились и пошли домой",

        ]
    ];
    $room=$rooms[$id];
    if($id==3){
        return view("death",[
            "room"=>$room
        ]);
    }
    if($id==11){
        return view("win",[
            "room"=>$room
        ]);
    }


        return view("quest",[
        "room"=>$room
    ]);

})->name("room");

Route::get("/", function (){
    return redirect()->route("room",["id"=>1]);
});
Route::get("room/", function (){
    return redirect()->route("room",["id"=>1]);
});